uhnp/src/InformationRegisters/ВалютыОтчетности/ВалютыОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВалютыОтчетности</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <attributes>
    <name>ОсновнаяВалюта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регламент</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонДокументаБД</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьВидОтчета</name>
    <comment>используется ШаблонДокументаБД</comment>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СтатусыПериодовСценариев/СтатусыПериодовСценариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПериодовСценариев</name>
  <resources>
    <name>СтатусПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусБлокировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияРегламента</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </resources>
  <attributes>
    <name>УправлениеПериодомСценария</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сценарии</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Периоды</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организации</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ВерсииРегламентовПодготовкиОтчетности/ВерсииРегламентовПодготовкиОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииРегламентовПодготовкиОтчетности</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодставлятьЗначенияАналитикПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическиПересчитыватьЗависимыеПоказатели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВГО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСверкиВГО</name>
    <type>
      <types>CatalogRef.ШаблоныСверкиВГО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроцесс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПроцесса</name>
    <type>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещатьДокументыВнеПроцесса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРасширенныеНастройкиПериметра</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетЭффективныхДолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТолькоУтвержденныеДанныеПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураГруппы</name>
    <attributes>
      <name>ОрганизационнаяЕдиница</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизационнаяЕдиницаРодитель</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОрганизационныеЕдиницы</name>
    <attributes>
      <name>ОрганизационнаяЕдиницаРодитель</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизационнаяЕдиница</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяВалюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОрганизационнойЕдиницы</name>
      <type>
        <types>CatalogRef.ВидыОрганизационныхЕдиниц</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективнаяДоля</name>
      <comment>используется если ручное заполнение долей(Не РасчетЭффективныхДолей)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>15</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтношениеКГруппе</name>
      <type>
        <types>CatalogRef.ГруппыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодИсключенияВГО</name>
      <type>
        <types>EnumRef.МетодыИсключенияВГО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеВалюты</name>
    <attributes>
      <name>ОрганизационнаяЕдиница</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ВидыОтчетов/ВидыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОтчетов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидАналитики1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики6</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоАналитик</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктуальныйШаблон</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрБухгалтерии</name>
    <type>
      <types>CatalogRef.РегистрыБухгалтерииБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьЗабалансовыеСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФормироватьАналитическиеРаскрытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыводитьГруппирующиеСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СокращеннаяОСВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучатьБухгалтерскиеИтогиПоГруппирующимСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРакурсы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникБД</name>
    <type>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьПоСтруктуреСправочника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожетИспользоватьсяДляУстановкиЛимитов</name>
    <comment>ОПК</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсРегистраИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектДляСогласованияЗначений</name>
    <type>
      <types>EnumRef.ОбъектыСогласованияЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоВыбраннымСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаФормированияФормул</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулыДляНачальныхСальдо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОтчета</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВидыИтоговПоСчетам</name>
    <attributes>
      <name>ВидИтогаПоСчету</name>
      <type>
        <types>EnumRef.ВидыБухгалтерскихИтогов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыУстановкиЛимитов</name>
    <comment>ОПК</comment>
    <attributes>
      <name>КолонкаОтчета</name>
      <comment>ОПК</comment>
      <type>
        <types>CatalogRef.КолонкиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Предназначение</name>
      <comment>ОПК</comment>
      <type>
        <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеСчета</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетИспользуется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/ВалютыОтчетности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура СформироватьЗаписиВалютыОтчетности(ВерсияРегламента, Отказ = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВерсияРегламента", ВерсияРегламента);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОрганизационныеЕдиницы.ОрганизационнаяЕдиница КАК Организация,
	|	ОрганизационныеЕдиницы.ОсновнаяВалюта КАК Валюта,
	|	ИСТИНА КАК ОсновнаяВалюта,
	|	ОрганизационныеЕдиницы.Ссылка КАК Регламент,
	|	ОрганизационныеЕдиницы.Ссылка.МеткаВремени КАК Период
	|ПОМЕСТИТЬ Т
	|ИЗ
	|	Справочник.ВерсииРегламентовПодготовкиОтчетности.ОрганизационныеЕдиницы КАК ОрганизационныеЕдиницы
	|ГДЕ
	|	ОрганизационныеЕдиницы.Ссылка = &ВерсияРегламента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеВалюты.ОрганизационнаяЕдиница,
	|	ДополнительныеВалюты.Валюта,
	|	ЛОЖЬ,
	|	ДополнительныеВалюты.Ссылка,
	|	ДополнительныеВалюты.Ссылка.МеткаВремени
	|ИЗ
	|	Справочник.ВерсииРегламентовПодготовкиОтчетности.ДополнительныеВалюты КАК ДополнительныеВалюты
	|ГДЕ
	|	ДополнительныеВалюты.Ссылка = &ВерсияРегламента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Организация,
	|	т.Валюта,
	|	МАКСИМУМ(т.ОсновнаяВалюта) КАК ОсновнаяВалюта,
	|	т.Регламент,
	|	т.Период
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Организация КАК Организация,
	|		Т.Валюта КАК Валюта,
	|		Т.ОсновнаяВалюта КАК ОсновнаяВалюта,
	|		Т.Регламент КАК Регламент,
	|		Т.Период КАК Период
	|	ИЗ
	|		Т КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
	|		Т.Валюта,
	|		Т.ОсновнаяВалюта,
	|		Т.Регламент,
	|		Т.Период
	|	ИЗ
	|		Т КАК Т) КАК т
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Валюта,
	|	т.Организация,
	|	т.Период,
	|	т.Регламент";
	
	НаборЗаписей = РегистрыСведений.ВалютыОтчетности.СоздатьНаборЗаписей();
		
	НаборЗаписей.Отбор.Регламент.Установить(ВерсияРегламента);
	НаборЗаписей.Отбор.Период.Установить(ВерсияРегламента.МеткаВремени);
	НаборЗаписей.Отбор.ШаблонДокументаБД.Установить(Неопределено);
	
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Попытка
		НаборЗаписей.Записать(Истина);	
	Исключение
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ОписаниеОшибки(), Отказ);		
	КонецПопытки;	
	
КонецПроцедуры

Процедура СохранитьИзмененияВалютОтчетности(ВерсияОрганизационнойСтруктуры, ТаблицаВалютОтчетности) Экспорт

	МассивЗаписи = РегистрыСведений.ВалютыОтчетности.СоздатьНаборЗаписей();
	
	МассивЗаписи.Отбор.Регламент.Значение   = ВерсияОрганизационнойСтруктуры;
	МассивЗаписи.Отбор.Регламент.Использование = Истина;
	МассивЗаписи.Отбор.Период.Значение = ВерсияОрганизационнойСтруктуры.МеткаВремени;
	МассивЗаписи.Отбор.Период.Использование = Истина;
	
	МассивЗаписи.Прочитать();
    МассивЗаписи.Очистить();
	
	МассивЗаписи_ИзРегламента = РегистрыСведений.ВалютыОтчетности.СоздатьНаборЗаписей();
	
	МассивЗаписи_ИзРегламента.Отбор.Регламент.Значение   = ВерсияОрганизационнойСтруктуры;
	МассивЗаписи_ИзРегламента.Отбор.Регламент.Использование = Истина;
	МассивЗаписи_ИзРегламента.Отбор.Период.Значение = ВерсияОрганизационнойСтруктуры.МеткаВремени;
	МассивЗаписи_ИзРегламента.Отбор.Период.Использование = Истина;
	МассивЗаписи_ИзРегламента.Отбор.ШаблонДокументаБД.Значение = Неопределено;
	МассивЗаписи_ИзРегламента.Отбор.ШаблонДокументаБД.Использование = Истина;

	МассивЗаписи_ИзРегламента.Прочитать();
		
	Для Каждого Элемент Из МассивЗаписи_ИзРегламента Цикл
		НоваяСтрока = МассивЗаписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
	КонецЦикла;
	
	Для Каждого Элемент Из ТаблицаВалютОтчетности Цикл
		
		Если НЕ Элемент.ВидОтчета.Пустая() И Элемент.СписокВалют.Количество() <> 0 Тогда  //Добавляем дополнительные валюты для конкретных ВО
			Для Каждого ТекВалюта Из Элемент.СписокВалют Цикл
				
				НоваяСтрока = МассивЗаписи.Добавить();
				
				НоваяСтрока.Организация    = Элемент.Организация;
				НоваяСтрока.ШаблонДокументаБД      = Элемент.ВидОтчета;
				НоваяСтрока.Валюта         = ТекВалюта.Значение;
				НоваяСтрока.ОсновнаяВалюта = ТекВалюта.Пометка;
				НоваяСтрока.Период         = ВерсияОрганизационнойСтруктуры.МеткаВремени;
				НоваяСтрока.Регламент      = ВерсияОрганизационнойСтруктуры;
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	ТЗВалют = МассивЗаписи.Выгрузить();
	ТЗВалют.Свернуть("Валюта,ДокументБД,ШаблонДокументаБД,Регламент,ОсновнаяВалюта,Период,Организация");
	МассивЗаписи.Загрузить(ТЗВалют);
	
	МассивЗаписи.Отбор.ШаблонДокументаБД.Использование = Ложь;
	МассивЗаписи.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьТаблицуВалютДляВерсииОрганизационнойСтруктуры(ВерсияРегламента) Экспорт
	
	ТаблицаВалют = Новый ТаблицаЗначений;
	
	ТаблицаВалют.Колонки.Добавить("Организация"         , Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаВалют.Колонки.Добавить("ВидОтчета"           , Новый ОписаниеТипов("СправочникСсылка.ВидыОтчетов"));
	ТаблицаВалют.Колонки.Добавить("ОсновнаяВалюта"      , Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаВалют.Колонки.Добавить("ДополнительныеВалюты", Новый ОписаниеТипов("СписокЗначений"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВалютыОтчетности.ШаблонДокументаБД КАК ВидОтчета,
	|	ВалютыОтчетности.Организация КАК Организация,
	|	ВалютыОтчетности.Валюта,
	|	ВалютыОтчетности.ОсновнаяВалюта
	|ИЗ
	|	РегистрСведений.ВалютыОтчетности КАК ВалютыОтчетности
	|ГДЕ
	|	ВалютыОтчетности.Период = НАЧАЛОПЕРИОДА(&МеткаДокумента, ДЕНЬ)
	|	И ВалютыОтчетности.Регламент = &Регламент
	|ИТОГИ ПО
	|	Организация,
	|	ВидОтчета";
	
	Запрос.УстановитьПараметр("Регламент", ВерсияРегламента);
	Запрос.УстановитьПараметр("МеткаДокумента", ВерсияРегламента.МеткаВремени);
		
	ВыборкаОрганизаций = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизаций.Следующий() Цикл
		
		ВыборкаВидовОтчетов = ВыборкаОрганизаций.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаВидовОтчетов.Следующий() Цикл
			
			Выборка = ВыборкаВидовОтчетов.Выбрать();
			
			СписокДопВалют = Новый СписокЗначений;
			ОсновнаяВалюта = Справочники.Валюты.ПустаяСсылка();
			
			НоваяСтрока = ТаблицаВалют.Добавить();
			
			НоваяСтрока.Организация = ВыборкаОрганизаций.Организация;
			НоваяСтрока.ВидОтчета   = ВыборкаВидовОтчетов.ВидОтчета;
			НоваяСтрока.ОсновнаяВалюта = Справочники.Валюты.ПустаяСсылка();
			
			НоваяСтрока.ДополнительныеВалюты = Новый СписокЗначений;
			НоваяСтрока.ДополнительныеВалюты.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Валюты");
						
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ОсновнаяВалюта Тогда
					НоваяСтрока.ОсновнаяВалюта = Выборка.Валюта;
				Иначе
					НоваяСтрока.ДополнительныеВалюты.Добавить(Выборка.Валюта);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаВалют;
	
КонецФункции

// Функция определяет основную и дополнительные (если есть) валюты для экземпляра отчета.
Функция ОпределитьВалютыОтчета(ВерсияОрганизационнойСтруктуры, ВидОтчета, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВалютыОтчетностиСрезПоследних.Валюта,
	|	ВалютыОтчетностиСрезПоследних.ОсновнаяВалюта,
	|	ИСТИНА КАК НастройкиРегламента
	|ИЗ
	|	РегистрСведений.ВалютыОтчетности.СрезПоследних(
	|			&Период,
	|			Регламент = &Регламент
	|				И ШаблонДокументаБД В (НЕОПРЕДЕЛЕНО,ЗНАЧЕНИЕ(Справочник.ВидыОтчетов.ПустаяСсылка))
	|				И Организация = &Организация) КАК ВалютыОтчетностиСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВалютыОтчетностиСрезПоследних.Валюта,
	|	ВалютыОтчетностиСрезПоследних.ОсновнаяВалюта,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ВалютыОтчетности.СрезПоследних(
	|			&Период,
	|			ШаблонДокументаБД = &ВидОтчета
	|				И Организация = &Организация
	|				И Регламент = &Регламент) КАК ВалютыОтчетностиСрезПоследних
	|ИТОГИ ПО
	|	НастройкиРегламента";
	
	Запрос.УстановитьПараметр("Период", 		ВерсияОрганизационнойСтруктуры.МеткаВремени);
	Запрос.УстановитьПараметр("Регламент", 		ВерсияОрганизационнойСтруктуры);
	Запрос.УстановитьПараметр("ВидОтчета",		ВидОтчета);
	Запрос.УстановитьПараметр("Организация",	Организация);
	
	ВыборкаПоТипуЗаписи = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОсновнаяВалюта = Справочники.Валюты.ПустаяСсылка();
	
	ДополнительныеВалюты = Новый СписокЗначений;
	ДополнительныеВалюты.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Валюты");
	
	Пока ВыборкаПоТипуЗаписи.Следующий() Цикл
		НастройкиРегламента = ВыборкаПоТипуЗаписи.НастройкиРегламента;
		Выборка = ВыборкаПоТипуЗаписи.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ОсновнаяВалюта И НастройкиРегламента Тогда
				ОсновнаяВалюта = Выборка.Валюта;
			Иначе
				ДополнительныеВалюты.Добавить(Выборка.Валюта);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура("ОсновнаяВалюта, ДополнительныеВалюты", ОсновнаяВалюта, ДополнительныеВалюты);
	
КонецФункции

// Возвращаем основную валюту организации для переданных периода и сценария
//
// Параметры
//		ПериодСценария - период сценария для которого осуществляется проверка.
//		Сценарий - сценарий для которого осуществляется проверка.
//		Организация - организация для которой проверяется роль пользователя.
//
// Возвращаемое значение:
//   Справочник.Валюты - основная валюта организации.
//	 Неопределено - возникла ошибка
//
Функция ОсновнаяВалютаОрганизации(ПериодСценария, Сценарий, Организация) Экспорт
	
	Валюта = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВалютыОтчетностиСрезПоследних.Валюта КАК Валюта
	|ИЗ
	|	РегистрСведений.СтатусыПериодовСценариев КАК СтатусыПериодовСценариев
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВалютыОтчетности.СрезПоследних(
	|				,
	|				ОсновнаяВалюта
	|					И ШаблонДокументаБД = НЕОПРЕДЕЛЕНО
	|					И Организация = &Организация) КАК ВалютыОтчетностиСрезПоследних
	|		ПО (ВалютыОтчетностиСрезПоследних.Регламент = СтатусыПериодовСценариев.ВерсияРегламента)
	|			И (СтатусыПериодовСценариев.Сценарии = &Сценарий)
	|			И (СтатусыПериодовСценариев.Периоды = &ПериодСценария)
	|			И (НЕ СтатусыПериодовСценариев.СтатусБлокировки = 1)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодСценария", ПериодСценария);
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Валюта = ВыборкаДетальныеЗаписи.Валюта;
	КонецЕсли;
	
	Возврат Валюта;
	
КонецФункции

Функция ВернутьТаблицуВалютОтчетности(ВерсияОрганизационнойСтруктуры) Экспорт
	
	ТаблицаВалютОтчетности = Новый ТаблицаЗначений;
	
	ТаблицаВалютОтчетности.Колонки.Добавить("ВидОтчета", Новый ОписаниеТипов("СправочникСсылка.ВидыОтчетов"));
	ТаблицаВалютОтчетности.Колонки.Добавить("ДокументБД", Новый ОписаниеТипов("СправочникСсылка.ДокументыБД"));
	ТаблицаВалютОтчетности.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаВалютОтчетности.Колонки.Добавить("СписокВалют", Новый ОписаниеТипов("СписокЗначений"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВалютыОтчетности.ШаблонДокументаБД КАК ВидОтчета,
	|	ВалютыОтчетности.ДокументБД КАК ДокументБД,
	|	ВалютыОтчетности.Организация КАК Организация,
	|	ВалютыОтчетности.Валюта КАК Валюта,
	|	ВалютыОтчетности.ОсновнаяВалюта КАК ОсновнаяВалюта,
	|	ВалютыОтчетности.Валюта.Наименование КАК ПредставлениеВалюты,
	|	ВалютыОтчетности.Валюта.Код КАК КодВалюты
	|ИЗ
	|	РегистрСведений.ВалютыОтчетности КАК ВалютыОтчетности
	|ГДЕ
	|	ВалютыОтчетности.Период = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
	|	И ВалютыОтчетности.ШаблонДокументаБД <> НЕОПРЕДЕЛЕНО
	|	И ВалютыОтчетности.Регламент = &Регламент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВалютыОтчетностиСрезПоследних.ШаблонДокументаБД = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОтчетов.ПустаяСсылка)
	|		ИНАЧЕ ВалютыОтчетностиСрезПоследних.ШаблонДокументаБД
	|	КОНЕЦ,
	|	ВалютыОтчетностиСрезПоследних.ДокументБД,
	|	ВалютыОтчетностиСрезПоследних.Организация,
	|	ВалютыОтчетностиСрезПоследних.Валюта,
	|	ВалютыОтчетностиСрезПоследних.ОсновнаяВалюта,
	|	ВалютыОтчетностиСрезПоследних.Валюта.Наименование,
	|	ВалютыОтчетностиСрезПоследних.Валюта.Код
	|ИЗ
	|	РегистрСведений.ВалютыОтчетности.СрезПоследних(
	|			&Период,
	|			ШаблонДокументаБД В (ЗНАЧЕНИЕ(Справочник.ВидыОтчетов.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
	|				И Регламент = &Регламент) КАК ВалютыОтчетностиСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодВалюты
	|ИТОГИ ПО
	|	ВидОтчета,
	|	Организация";
	
	Запрос.УстановитьПараметр("Период", ВерсияОрганизационнойСтруктуры.МеткаВремени);
	Запрос.УстановитьПараметр("Регламент", ВерсияОрганизационнойСтруктуры);
	
	ВыборкаВидОтчета = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидОтчета.Следующий() Цикл
		
		ВыборкаОрганизаций = ВыборкаВидОтчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОрганизаций.Следующий() Цикл
			
			НоваяСтрока = ТаблицаВалютОтчетности.Добавить();
			НоваяСтрока.ВидОтчета   = ВыборкаВидОтчета.ВидОтчета;
			НоваяСтрока.ДокументБД   = ВыборкаВидОтчета.ДокументБД;
			НоваяСтрока.Организация = ВыборкаОрганизаций.Организация;
			
			Выборка = ВыборкаОрганизаций.Выбрать();
			НоваяСтрока.СписокВалют = Новый СписокЗначений;
			НоваяСтрока.СписокВалют.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Валюты");
			
			Пока Выборка.Следующий() Цикл
				НоваяСтрока.СписокВалют.Добавить(Выборка.Валюта, Выборка.ПредставлениеВалюты, Выборка.ОсновнаяВалюта);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаВалютОтчетности;
	
КонецФункции

#КонецЕсли
